Revit 2024 API
ScheduleDefinition.GetFilters Method
 Gets all filters in this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IList<ScheduleFilter> GetFilters()
Visual Basic
Public Function GetFilters As IList(Of ScheduleFilter)
Visual C++
public:
IList<ScheduleFilter^>^ GetFilters()
Return Value
 A list of all filters.
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace